[
    {
        "company": "Software Engineering Course",
        "company_location": "",
        "role": "",
        "team": "",
        "time_duration": "Spring 2021",
        "details": [
            {
                "title": "Mental Health Awareness App",
                "description": "Developed an app using the MERN stack and Expo. Main features included: users and user management, user data synchronized with database, functional user inferface, integration with Tumblr API, AI based recommendation system with Tensorflow.js"
            },
            {
                "title": "Battle Ship",
                "description": "Took over, refactored, and cleaned up an existing implementation of BattleShip. Converted the user interface to a GUI from CLI. Added graphics using PyGame. Implemented additional functionality building on the previous version."
            }
        ]
    },
    {
        "company": "Microsoft",
        "company_location": "Vancouver, Canada",
        "role": "Software Engineer",
        "team": "OneNote",
        "time_duration": "Nov 2014 - May 2016",
        "details": [
            {
                "title": "Embedded Videos and Web Content",
                "description": "Worked on adding ability on OneNote to host web content, making sure it is backwards compatible. Implemented features to make handling and editing web content on the OneNote page easier. Added support for this feature on OneNote web app."
            },
            {
                "title": "Merged Cells for Tables",
                "description": "Added support for spanned cells for tables in OneNote, keeping in mind backwards compatibility. Implemented these capabilities in OneNote web app."
            },
            {
                "title": "Realtime Ink",
                "description": "As a ramp up project, prototyped ink collaboration using SignalR web-sockets. Worked on experimenting load and delay with multiple inputs in realtime."
            }
        ]
    },
    {
        "company": "Oracle",
        "company_location": "Bangalore, India",
        "role": "Software Engineering Intern",
        "team": "Apps for Enterprises",
        "time_duration": "Nov 2014 - May 2016",
        "details": [
            {
                "title": "Containerization of iOS Apps",
                "description": "Worked on sand-boxing of enterprise applications (containerization) which enable them to be installed on employee's iOS devices without worrying about security issues. Implemented wrapping of library function calls using swizzling, objective-c backend, linker flags and dynamic library injection."
            },
            {
                "title": "Sandboxed Browser App",
                "description": "Built a demo browser application for iOS. Containerized the app using the custom script, so that it only works for certain urls."
            }
        ]
    }
]
